#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

void test1() {
	// 左移，右移。 

	// a << b: 将a表示的二进制数，左移b位。 
	int a = 66;

	// 第一步： 将数转成2进制。 
	// 2+64
	//                                    8421
	// 0000 0000 0000 0000 0000 0000 0100 0010
	// 0000 0000 0000 0000 0000 0001 0000 1000
	// 8 + 256 == 264
	a << 2;
}


void test2() {
	// 按位与，按位或，按位异或。 

	// 与： 将两个二进制数放在一起。 两个数同位全为1，结果才为1. 
	// 或： 将两个二进制数放在一起。 只要有1，就是1.  
	// 异或： 将两个二进制数放在一起。相同为0，不同为1 

	int num1 = 56;
	int num2 = 46;

	// num1 & num2
	// 0011 1000   ==== 56
	// 0010 1110   ==== 46
	// 0010 1000   ==== 8+32===40

	// num1 | num2
	// 0011 1000   ==== 56
	// 0010 1110   ==== 46
	// 0011 1110   ==== 2+4+8+16+32 = 62

	// num1 ^ num2
	// 0011 1000   ==== 56
	// 0010 1110   ==== 46
	// 0001 0110 === 2+4+16=22

	printf("%d\n", (num1 & num2));
	printf("%d\n", (num1 | num2));
	printf("%d\n", (num1 ^ num2));
}


int main(void) {

	test2();

	return 0;
}